JWSM-Tech/apd-esp8266-connectivity/src/main.cpp
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <ESP8266mDNS.h>
#include <ESP8266HTTPClient.h>
#include <WiFiClient.h>
#include <ArduinoJson.h>
#include <math.h>
#include <string>
#include <stdbool.h>

#define baudRate 115200

#define SSID_SIZE 40
#define PASSWORD_SIZE 40

bool WiFiNotSet = true;

#define pillContainersCount 8

//container max digit count
#define maxDigitCount 2
#define maxPillName 15

#define hourDigits 2
#define minuteDigits 2
#define dayDigits 2
#define monthDigits 2
#define yearDigits 4

//Set Parameters for serial communication
#define receiveAnalyticsParam 1 //receive analytics
#define receiveNetworkParam 2 // receive network
#define receivePillInfoParam 3
#define sendAddReminderParam 4 // send reminder
#define receiveAddReminderParam 4 //receive reminder
#define sendRemoveReminderParam 5 // send reminder
#define receiveRemoveReminderParam 5 //receive reminder
#define sendRefillParam 6 //send refill
#define receiveRefillParam 6 //receive refill
#define sendAddPillParam 7 //send add
#define receiveAddPillParam 7 //receive add
#define sendRemovePillParam 8 //send remove
#define receiveRemovePillParam 8 //receive remove

#define sep_character ' '

#define debug false

const int RX_pin = 13;
const int TX_pin = 15;

int param = 0;

const size_t JSON_SIZE = JSON_OBJECT_SIZE(30);
StaticJsonDocument<JSON_SIZE> doc;
JsonObject object;

String json;

void sendRefillUART();
void sendRemoveReminderUART();
void sendRemovePillUART();
void sendAddPillUART();
void sendAddReminderUART();

bool receiveAnalyticsUART();
bool receiveAddRemindersUART();
bool receiveRemoveRemindersUART();
bool receiveAddPillUART();
bool receiveRemovePillUART();
bool receiveRefillUART();


int readnInt(int digitsToRead);
char *readnChar(char stringLength, char *list);
int *readnIntList(char digitCount, int *list, int listLength);

void post_DB(String json);
void Analytics_to_JSON();
void Pill_Status_to_JSON();
void Reminders_to_JSON();

void CORS();

char ssid[SSID_SIZE] = "ELMEGANETWORK"; //  your network SSID (name)

char password[PASSWORD_SIZE] = "123abcgg"; // your network password

const char *rest_host = "http://apd-webapp-backend.herokuapp.com/api/analytics";

char str[200];

char temp_original_date[20];
char temp_taken_date[20];

#define dlay delay(5000);

struct alarm //hour, minute, pillQuantities
{

  unsigned char hour;
  unsigned char minute;
  int pillQuantities[pillContainersCount];
};

struct refill //pillNames and pillQuantities
{
  int pillQuantities[pillContainersCount];
  char pillNames[pillContainersCount][maxPillName];
};

struct analytic // fields: original_date, taken_date, completed, pill_names, pill_quanitites
{
  unsigned char hour;   //original hour for alarm
  unsigned char minute; // original minute for alarm
  int pillQuantities[pillContainersCount];
  char pillNames[pillContainersCount][maxPillName];
  bool taken;  // true if user was reminded successfully
  char day;    // current day
  char month;  //current month
  int year;    // current year
  char dow;    // current day of week
  char TakenH; // hour when analytic was generated
  char TakenM; // minute when analytic was generated
};

struct alarm schedule[pillContainersCount];
struct analytic analytics;
struct refill fill;

ESP8266WebServer server(80);

// handle server functions
void handleRoot() // handle GET request to apdwifimodule.local
{
  server.send(200, "text/plain", "hello from apdwifimodule.local");
}

void handlePillInfoGET() //Handle Refill GET call from web application and send pill names and quantity data
{
  if (debug)
    Serial.println("Entered handlePillInfoGET");
  
  Pill_Status_to_JSON();
  CORS();
  server.send(200, "application/json", json);
}

void handleRemindersInfoGET() //Handle Refill GET call from web application and send pill names and quantity data
{
  if (debug)
    Serial.println("Entered handleRemindersInfoGET");
  
  Reminders_to_JSON();
  CORS();
  server.send(200, "application/json", json);
}

void CORS()
{
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.sendHeader("Access-Control-Max-Age", "10000");
  server.sendHeader("Access-Control-Allow-Methods", "PUT,POST,GET,DELETE,OPTIONS");
  server.sendHeader("Access-Control-Allow-Headers", "*");
}

// server POST handler functions
void deserializeJSONtoObject() //base JSON POST request handler for the ESP8266 web server
{
  // json = server.arg("plain");
  if (debug)
    Serial.println("json is " + server.arg("plain"));

  if (server.arg("plain")) // if the POST request has a body
  {
    deserializeJson(doc, server.arg("plain")); // assuming the POST body is JSON formatted
    object = doc.as<JsonObject>();
  }
}

void handleAddReminderPOST() // handle POST request from reminders to apdwifimodule.local
{
  if (debug)
    Serial.println("Entered handleAddReminderPOST");
  param = sendAddReminderParam;
  deserializeJSONtoObject();
  sendAddReminderUART();

  while(!Serial.available()) dlay;
  receiveAddRemindersUART();

  server.send(201, "text/plain", "the fields have been updated");
}

void handleRemoveReminderPOST() // handle POST for delete request from reminders to apdwifimodule.local
{
  if (debug)
    Serial.println("Entered handleRemoveReminderPOST");
  param = sendRemoveReminderParam;
  deserializeJSONtoObject();
  sendRemoveReminderUART();
  while(!Serial.available()) dlay;
  receiveRemoveRemindersUART();

  server.send(201, "text/plain", "the fields have been updated");
}

void handleAddPillPOST() //Handle Add POST call from web application 
{
  if (debug)
    Serial.println("Entered handleAddPillPOST");
  param = sendAddPillParam;
  deserializeJSONtoObject();
  sendAddPillUART();
  while(!Serial.available()) dlay;
  receiveAddPillUART();
  //Serial.print("done");
  server.send(201, "text/plain", "the fields have been updated");
}

void handleRemovePillPOST() //Handle Add POST call from web application 
{
  if (debug)
    Serial.println("Entered handleRemovePillPOST");
  param = sendRemovePillParam;

  CORS();
  deserializeJSONtoObject();
  sendRemovePillUART();
  while(!Serial.available()) dlay;
  receiveRemovePillUART();

  server.send(201, "text/plain", "the fields have been updated");
}

void handleRefillPOST() //Handle Refill POST call from web application 
{
  if (debug)
    Serial.println("Entered handleRefillPOST");
  param = sendRefillParam;
  sendRefillUART();
  deserializeJSONtoObject();
  while(!Serial.available()) dlay;
  receiveRefillUART();

  server.send(201, "text/plain", "the fields have been updated");
}


//server NOT FOUND handler functions
void handleNotFound() //Handle NotFound resources in apdwifimodule.local
{
  if (server.method() == HTTP_OPTIONS)
  {
    server.sendHeader("Access-Control-Allow-Origin", "*");
    server.sendHeader("Access-Control-Max-Age", "10000");
    server.sendHeader("Access-Control-Allow-Methods", "HEAD,PUT,POST,GET,OPTIONS");
    server.sendHeader("access-control-allow-credentials", "false");
    server.sendHeader("Access-Control-Allow-Headers", "*");
    server.send(204);
  }

  String message = "File Not Found\n\n";
  message += "URI: ";
  message += server.uri();
  message += "\nMethod: ";

  if (server.method() == HTTP_GET)
  {
    message += "GET";
  }
  else
  {
    message += "POST";
  }

  message += "\nArguments: ";
  message += server.args();
  message += "\n";

  for (int i = 0; i < server.args(); i++)
  {
    message += " " + server.argName(i) + ": " + server.arg(i) + "\n";
  }

  server.send(404, "text/plain", message);
}

// UART TX functions
void sendAddReminderUART() // sends reminder arguments to MCU through UART
{
  Serial.print("param:");
  Serial.print(itoa(sendAddReminderParam, str, 10));
  Serial.print(" ");

  Serial.print("Hour");
  Serial.print(":");
  delay(10);
  Serial.print(object["hour"].as<char *>());
  delay(10);
  Serial.print(" ");

  delay(10);
  Serial.print("Minute");
  Serial.print(":");
  delay(10);
  Serial.print(object["minute"].as<char *>());
  delay(10);
  Serial.print(" ");

