JWSM-Tech/apd-esp8266-connectivity/src/main.cpp
  Serial.print("pillQuantities:[");

  for (int i = 0; i < pillContainersCount - 1; i++)
  {
    delay(10);
    Serial.print(object["pillQuantities"][i].as<int>());
    Serial.print(",");
  }
  if (pillContainersCount >= 2)
    Serial.print(object["pillQuantities"][pillContainersCount - 1].as<int>()); //runs if pillContainersCount is at least 2
  Serial.print("]\n");
}

void sendRemoveReminderUART() // sends reminder arguments to MCU through UART
{
  Serial.print("param:");
  Serial.print(itoa(sendRemoveReminderParam, str, 10));
  Serial.print(" ");

  Serial.print("Hour");
  Serial.print(":");
  delay(10);
  Serial.print(object["hour"].as<char *>());
  delay(10);
  Serial.print(" ");

  delay(10);
  Serial.print("Minute");
  Serial.print(":");
  delay(10);
  Serial.print(object["minute"].as<char *>());
  delay(10);
  Serial.print(" ");

  Serial.print("\n");
}

void sendRefillUART() // sends refill arguments to MCU through UART
{
  Serial.print("param:");
  Serial.print(itoa(sendRefillParam, str, 10));
  Serial.print(" ");

  Serial.print("pillQuantities:[");

  for (int i = 0; i < pillContainersCount - 1; i++)
  {
    delay(10);
    Serial.print(object["pillQuantities"][i].as<int>());

    if (object["pillQuantities"][i].as<int>() > 0)
    {
      fill.pillQuantities[i] = object["pillQuantities"][i].as<int>();
    }
    Serial.print(",");
  }
  if (pillContainersCount >= 2)
    Serial.print(object["pillQuantities"][pillContainersCount - 1].as<int>()); //runs if pillContainersCount is at least 2
  Serial.print("]\n");
}

void sendAddPillUART() // sends add arguments to MCU through UART
{                  //param:6 pillName:hola pillQuantity:4 \n
  Serial.print("param:");
  Serial.print(itoa(sendAddPillParam, str, 10));
  Serial.print(" ");

  Serial.print("pillName:");
  delay(10);
  Serial.print(object["pillName"].as<char *>());
  Serial.print(" ");

  Serial.print("pillQuantity:");
  delay(10);
  char q = object["pillQuantity"].as<int>();
  if(q<10)
    Serial.printf("0%d", q);
  else
    Serial.printf("%d", q);

  Serial.print(" \n");
}

void sendRemovePillUART() // sends remove arguments to MCU through UART 
{
    Serial.print("param:");
  Serial.print(itoa(sendAddPillParam, str, 10));
  Serial.print(" ");

  Serial.print("pillName:");
  delay(10);
  Serial.print(object["pillName"].as<char *>());
  Serial.print(" ");
}

// UART RX functions
bool receiveAnalyticsUART() // receives analytic arguments from MCU through UART
{
  if (debug)
    Serial.print("\nEntered param = 1\n");

  if (Serial.find("Hour:"))
  {
    analytics.hour = readnInt(hourDigits);
    if (debug)
      Serial.printf("Analytics Hour = %d\n", analytics.hour);
  }

  if (Serial.find("Minute:"))
  {
    analytics.minute = readnInt(minuteDigits);
    if (debug)
      Serial.printf("Analytics Minute = %d\n", analytics.minute);
  }

  if (Serial.find("pillNames:["))
  {
    if (debug)
      Serial.print("pillNames are\n");

    for (int i = 0; i < pillContainersCount; i++)
    {
      for (int j = 0; j < maxPillName; j++)
      {

        if (Serial.peek() == ',')
        {
          Serial.read();
          analytics.pillNames[i][j] = '\0';
          j = maxPillName + 1;
        }

        else if (Serial.peek() == ']')
        {

          i = pillContainersCount - 1;
          j = maxPillName;
        }
        else
        {
          analytics.pillNames[i][j] = Serial.read();
        }
      }

      if (debug)
        Serial.printf("analytics.pillNames[%d] = %s\n", i, analytics.pillNames[i]);
    }

    if (debug)
      Serial.print("END PILL NAMES \n");
  }

  if (Serial.find("pillQuantities:["))
  {
    if (debug)
      Serial.print("pillQuantities are \n");
    readnIntList(maxDigitCount, analytics.pillQuantities, pillContainersCount);
    if (debug)
      Serial.println("END PILLQUANTITY");
  }

  // Day
  if (Serial.find("Day:"))
  {
    analytics.day = readnInt(dayDigits); // set analytics day
    if (debug)
      Serial.printf("Analytics day is %d\n", analytics.day);
  }

  //Month
  if (Serial.find("Month:"))
  {
    analytics.month = readnInt(monthDigits); // set analytics month
    if (debug)
      Serial.printf("Analytics month is %d\n", analytics.month);
  }

  //Year
  if (Serial.find("Year:"))
  {
    analytics.year = readnInt(yearDigits); // set analytics year
    if (debug)
      Serial.printf("Analytics year is %d\n", analytics.year);
  }

  //Day of Week
  if (Serial.find("DOW:"))
  {
    analytics.dow = readnInt(1); // set analytics dow
    if (debug)
      Serial.printf("Analytics Day of the Week is %d\n", analytics.dow);
  }

  //Taken Hour
  if (Serial.find("TakenH:"))
  {
    analytics.TakenH = readnInt(hourDigits); // set analytics taken hr
    if (debug)
      Serial.printf("Analytics Taken Hour is %d\n", analytics.TakenH);
  }

  //Taken Minute
  if (Serial.find("TakenM:"))
  {
    analytics.TakenM = readnInt(minuteDigits); // set analytics taken min
    if (debug)
      Serial.printf("Analytics Taken Hour is %d\n", analytics.TakenM);
  }

  //Taken boolean
  if (Serial.find("Taken:"))
  {
    analytics.taken = readnInt(1); // set analytics taken
    if (debug)
      Serial.printf("Analytics Taken is %d\n", analytics.taken);
  }

  Serial.find(sep_character);
  json = "";
  Analytics_to_JSON(); //adds the analytics generated to a json and posts the result to the Database
  post_DB(json);

  return true;
}

bool receiveAddRemindersUART() // receives alarm arguments from MCU through UART
{
  // storeIndex: Hour: Minute: pillQuantities:[0,0,0,0,0,0,0,0]
  if (debug)
    Serial.printf("\nEntered param = %d\n", receiveAddReminderParam);
  int storeIndex = 0;
  if (Serial.find("storeIndex:"))
  { 
    storeIndex = readnInt(1);
    if (debug)
      Serial.printf("Reminders Index = %d\n", storeIndex);
  }
  else
  {
    if(debug) Serial.printf("No storeIndex was found\n");
    return false;
  }

  if (Serial.find("Hour:"))
  {
    schedule[storeIndex].hour = readnInt(hourDigits);
    if (debug)
      Serial.printf("Reminders Hour = %d\n", schedule[storeIndex].hour);
  }
  else
  {
    if(debug) Serial.printf("No Hour was found\n");
    return false;
  }

