JWSM-Tech/apd-esp8266-connectivity/src/main.cpp
  if (Serial.find("Minute:"))
  {
    schedule[storeIndex].minute = readnInt(minuteDigits);
    if (debug)
      Serial.printf("Reminders Minute = %d\n", schedule[storeIndex].minute);
  }
  else
  {
    if(debug) Serial.printf("No Minute was found\n");
    return false;
  }
  

  if (Serial.find("pillQuantities:["))
  {
    if (debug)
      Serial.print("pillQuantities are \n");
    readnIntList(maxDigitCount, schedule[storeIndex].pillQuantities, pillContainersCount);
    if (debug)
      Serial.println("END PILLQUANTITIES");
  }
  else
  {
    if(debug) Serial.printf("No pillQuantities was found\n");
    return false;
  }

  Serial.find(sep_character);
  return true;
}

bool receiveRemoveRemindersUART() // receives alarm arguments from MCU through UART
{
  // storeIndex:1
  if (debug) Serial.printf("\nEntered param = %d\n", receiveRemoveReminderParam);
  int storeIndex = 0;
  if (Serial.find("storeIndex:"))
  { 
    storeIndex = readnInt(1);
    if (debug)
      Serial.printf("Reminders Index = %d\n", storeIndex);
  }
  else
  {
    if(debug) Serial.printf("No storeIndex was found\n");
    return false;
  }

  schedule[storeIndex].hour = 0;
  schedule[storeIndex].minute = 0;
  for(int i=0; i< pillContainersCount; i++) schedule[storeIndex].pillQuantities[i] = 0;
  
  Serial.find(sep_character);
  return true;
}

bool receiveNetworkUART() // receives network arguments from MCU through UART
{
  if (debug) Serial.printf("\nEntered param = %d\n", receiveNetworkParam);
  if(Serial.find("ssid:"))       //char* readnChar(char stringLength, char* list)
    readnChar(SSID_SIZE, ssid); // read SSID from UART
  else
    return false;

  if(Serial.find("password:"))
    readnChar(PASSWORD_SIZE, password); // read password from UART
  else
    return false;
  
  return true;
}

bool receivePillInfoUART() // receives pill information arguments from MCU through UART
{
  if(Serial.find("pillNames:["))
  {

    for (int i = 0; i < pillContainersCount; i++)
    {
      for (int j = 0; j < maxPillName; j++)
      {

        if (Serial.peek() == ',')
        {
          Serial.read();
          fill.pillNames[i][j] = '\0';
          j = maxPillName + 1;
        }

        else if (Serial.peek() == ']')
        {

          i = pillContainersCount - 1;
          j = maxPillName;
        }
        else
        {
          fill.pillNames[i][j] = Serial.read();
        }
      }

      if (debug)
        Serial.printf("fill.pillNames[%d] = %s\n", i, fill.pillNames[i]);
    }

    Serial.find("]");
  }
  else
    return false;
  

  if(Serial.find("pillQuantities:["))
  {
    readnIntList(maxDigitCount, fill.pillQuantities, pillContainersCount); // read quantities from UART
    Serial.find("]");
  }
  else return false;
  
  return true;
}

bool receiveRefillUART() // receives pill quanitites to update
{
  if(Serial.find("pillQuantities:["))
  {
    readnIntList(maxDigitCount, fill.pillQuantities, pillContainersCount); // read quantities from UART
    Serial.find("]");
  }
  else return false;

  return true;
}

bool setupInfoUART() //TODO
{
  //send all required variables at start
  return true;
}

bool receiveAddPillUART() // receives add pill parameters through UART
{ 
  // storeIndex: pillName: pillQuantity:
  if(debug) Serial.print("Entered receiveAddPillUART: ");
  int storeIndex = 0;
  if (Serial.find("storeIndex:"))
  { 
    storeIndex = readnInt(1);
    if (debug)
      Serial.printf("Add Pill Index = %d\n", storeIndex);
  }
  else
  {
    if(debug) Serial.printf("No storeIndex was found\n");
    return false;
  }

  if (Serial.find("pillName:"))
  {
    if (debug) Serial.print("pillName is \n");
    readnChar(maxPillName, fill.pillNames[storeIndex]);
    if (debug) Serial.println("END PILLNAME");
  }
  else
  {
    if(debug) Serial.printf("No pillName was found\n");
    return false;
  }


  if (Serial.find("pillQuantity:"))
  {
    fill.pillQuantities[storeIndex] = readnInt(maxDigitCount);
     if (debug) Serial.printf("pillQuantities are %d\n", fill.pillQuantities[storeIndex]);
  }
  else
  {
    if(debug) Serial.printf("No pillQuantity was found\n");
    return false;
  }

  Serial.find(sep_character);
  return true;
}

bool receiveRemovePillUART() // receives remove pill parameters through UART 
{
    // storeIndex:
  
  int storeIndex = 0;
  if (Serial.find("storeIndex:"))
  { 
    storeIndex = readnInt(1);
    if (debug)
      Serial.printf("Remove Pill Index = %d\n", storeIndex);
  }
  else
  {
    if(debug) Serial.printf("No storeIndex was found\n");
    return false;
  }

  if (Serial.find("pillName:"))
  {
    if (debug) Serial.print("pillName is \n");
    readnChar(maxPillName, fill.pillNames[storeIndex]);
    if (debug) Serial.println("END PILLNAME");
  }
  else
  {
    if(debug) Serial.printf("No pillName was found\n");
    return false;
  }


  if (Serial.find("pillQuantity:"))
  {
    if (debug) Serial.print("pillQuantities are \n");
    fill.pillQuantities[storeIndex] = readnInt(maxDigitCount);
    if (debug) Serial.println("END PILLQUANTITY");
  }
  else
  {
    if(debug) Serial.printf("No pillQuantity was found\n");
    return false;
  }

  Serial.find(sep_character);
  return true;
}


//WiFi setting functions
bool WiFiCredentialsReady() // returns true if SSID and PASSWORD are set, otherwise returns false
{
  if (!ssid[0])
    return false;
  if (!password[0])
    return false;
  return true;
}

void WiFi_setup() // Sets up WiFi using SSID and PASSWORD set
{
  if (debug)
    Serial.print("connecting to Wifi \n");

  WiFi.begin(ssid, password);

  while (WiFi.status() != WL_CONNECTED)
  { // while not Wireless Lan Connected
    delay(500);
    Serial.print(".");
  }

  if (debug)
  {
    Serial.println();
    Serial.println("Connected to WiFi successfully");
  }

  Serial.print("NODEMCU IP Address : ");

  Serial.print(WiFi.localIP());

  if (debug)
    Serial.println("\nsetting up MDNS responder");

  while (!MDNS.begin("apdwifimodule"))
  {

    Serial.print(".");
    dlay;
  }
  if (debug)
    Serial.println("\nMDNS has started");

  server.begin();

  if (debug)
    Serial.println("\nHTTP Server has started");

  MDNS.addService("http", "tcp", 80);
}

// read from Serial
int readnInt(int digitsToRead) // reads n digits from Serial port and returns resulting int
{
  int result = 0;

  for (int i = digitsToRead; i >= 0; i--)
  {

    if (Serial.peek() == sep_character) //
      i = -1;

    else
      result += (Serial.read() - '0') * pow(10, i - 1);
  }

  return result;
}

char *readnChar(char stringLength, char *list) // reads n (char stringLength) chars from String (char* list)
{

  if (debug)
    Serial.printf("readnChar function was entered\n");

