JWSM-Tech/apd-esp8266-connectivity/src/main.cpp
  for (int i = 0; i < stringLength; i++)
  {

    //        if(debug) Serial.printf("readnChar function - character %c, i=%d\n", Serial.peek(), i);

    if (Serial.peek() == sep_character || Serial.peek() == '\0')
    {
      Serial.read();
      list[i] = '\0';
      i = stringLength + 1;
    }
    else
      list[i] = Serial.read();
  }

  if (debug)
  {
    Serial.printf("readnChar function: list = %s\n", list);

    for (int i = 0; i < stringLength; i++)
    {
      Serial.printf("char at pos %d: %c\n", i, list[i]);
    }

    Serial.printf("readnChar function was finished\n");
  }

  return list;
}

int *readnIntList(char digitCount, int *list, int listLength) // reads n (char stringLength) chars from String (char* list)
{

  if (debug)
    Serial.printf("readnIntList function was entered\n");

  for (int i = 0; i < listLength; i++)
    list[i] = 0; //setting the list to 0

  for (int i = 0; i < listLength; i++)
  {
    for (int j = digitCount; j >= 0; j--)
    {
      if (Serial.peek() == ',' || Serial.peek() == ']')
      {
        Serial.read();
        j = -1;
      }
      else
      {
        list[i] += (Serial.read() - '0') * pow(10, j - 1);
      }
    }
    if (debug)
      Serial.printf("readnIntList function: list[%d] = %d\n", i, list[i]);
  }

  if (debug)
    Serial.printf("readnIntList function was finished\n");

  return list;
}

//UART RX function
void handleUARTRX() // RX function to check params for a UART transmission and react accordingly
{

  if (debug) Serial.print("\nENTERED RX\n");

  if (Serial.find("param:"))
  {

    param = Serial.read() - '0';

    if (debug)
      Serial.printf("\nparam = %d\n", param);
  }

  switch(param)
  {
    // case setupInfoParam: //error avoidance
    // setupInfoUART();
    // break;
  case receiveAnalyticsParam: //receive analytics
    receiveAnalyticsUART();
    break;
  case receiveNetworkParam: // receive network
    receiveNetworkUART();
    break;
  case receivePillInfoParam: //error avoidance
    receivePillInfoUART();
    break;
  case receiveAddReminderParam: //receive reminder
    receiveAddRemindersUART();
    break;
  case receiveRefillParam: //receive refill
    receiveRefillUART();
    break;
  case receiveAddPillParam: //receive add
    receiveAddPillUART();
    break;
  case receiveRemovePillParam: //receive remove
    receiveRemovePillUART();
    break;
  }
  dlay;
  param = 0;
  if (debug)
    Serial.print("\nFINISHED RX\n");
}

void setup() // put your setup code here, to run once:
{

  Serial.begin(baudRate);
  if (debug)
    Serial.println();

  WiFi.mode(WIFI_STA); //WIFI_STA - Devices that connect to WiFi network are called stations (STA)

  Serial.flush();

  if (WiFiCredentialsReady() && WiFiNotSet)
  {
    if (debug)
      Serial.print("WiFi ssid and password are set and not set up\n");
    WiFi_setup();
    if (debug)
      Serial.print("WiFi ssid and password are set and is set up\n");
    WiFiNotSet = false;
  }

  if (debug)
    Serial.println();

  //setup Routes
  server.on("/", HTTP_GET, handleRoot);
  server.on("/submit_reminder_data", HTTP_POST, handleAddReminderPOST);
  server.on("/get_pill_status", HTTP_GET, handlePillInfoGET);
  server.on("/get_reminders", HTTP_GET, handleRemindersInfoGET);
  server.on("/submit_refill_data", HTTP_POST, handleRefillPOST);
  server.on("/submit_add_data", HTTP_POST, handleAddPillPOST);
  server.on("/remove_pill", HTTP_POST, handleRemovePillPOST);
  server.on("/remove_reminder", HTTP_POST, handleRemoveReminderPOST);

  server.on("/", HTTP_OPTIONS, []() {
    CORS();
    server.send(204);
  });

  server.on("/get_pill_status", HTTP_OPTIONS, []() {
    // server.sendHeader("Content-Type", "application/json");
    CORS();
    server.send(204, "application/json");
  });

  server.onNotFound(handleNotFound);

  Serial.print("Finished Basic Setup");
}

void post_DB(String json) // posts JSON to REST API running on rest_host
{

  if (debug)
    Serial.println("json is " + json + "\n");

  while (WiFi.status() != WL_CONNECTED)
  { // while not Wireless Lan Connected
    if (debug)
      Serial.println("WiFi is not connected");

    dlay;
  }

  if (WiFi.status() == WL_CONNECTED)
  {

    WiFiClient client;

    HTTPClient http;

    if (debug)
      Serial.println("NodeMCU is connected to the internet\nStarting http request to rest_host");

    if (http.begin(client, rest_host))
    { // HTTP
      if (debug)
        Serial.println("[HTTP] POST...");

      http.addHeader("Content-Type", "application/json");

      int httpCode = http.POST(json);

      if (httpCode > 0)
      {
        // HTTP header has been send and Server response header has been handled
        if (debug)
          Serial.printf("[HTTP] POST... code: %d", httpCode);

        // file found at server
        //        if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY) {
        //
        //        }
      }
      else
      {
        if (debug)
          Serial.printf("[HTTP] GET... failed, error: %s", http.errorToString(httpCode).c_str());
      }

      http.end();
    }
  }

  else
  {
    if (debug)
      Serial.printf("[HTTP} Unable to connect");
  }

  json = "";
}

// set struct to JSON
void Analytics_to_JSON() // generates JSON from analytic struct
{

  //            'original_date': self.original_date,
  //            'taken_date': self.taken_date,
  //            'completed': self.completed,
  //            'pill_names': self.pill_names,
  //            'pill_quantities': self.pill_quantities

  //   char* temp_original_date;
  //   char* temp_taken_date;

  json = "";

  DynamicJsonDocument Analyticsdoc(1024);

  JsonObject jobject = Analyticsdoc.to<JsonObject>();

  if (debug)
    Serial.printf("original_date is %02d-%02d-%02d %02d:%02d:00\n", analytics.year, analytics.month, analytics.day, analytics.hour, analytics.minute);

  sprintf(temp_original_date, "%02d-%02d-%02d %02d:%02d:00", analytics.year, analytics.month, analytics.day, analytics.hour, analytics.minute); //verify if errors
  jobject["original_date"] = temp_original_date;

  if (debug)
    Serial.printf("taken_date is %02d-%02d-%02d %02d:%02d:00\n", analytics.year, analytics.month, analytics.day, analytics.hour, analytics.minute);

  sprintf(temp_taken_date, "%02d-%02d-%02d %02d:%02d:00", analytics.year, analytics.month, analytics.day, analytics.TakenH, analytics.TakenM); //verify if errors
  jobject["taken_date"] = temp_taken_date;

