JWSM-Tech/apd-esp8266-connectivity/src/main.cpp
  jobject["completed"] = analytics.taken;

  JsonArray pillNameArr = Analyticsdoc.createNestedArray("pill_names");

  for (int i = 0; i < pillContainersCount; i++)
  {
    // for(int j = 0; j<maxPillName; j++){
    pillNameArr.add(analytics.pillNames[i]);
    // }
  }

  JsonArray pillQuantitiesArr = Analyticsdoc.createNestedArray("pill_quantities");

  for (int i = 0; i < pillContainersCount; i++)
  {
    pillQuantitiesArr.add(analytics.pillQuantities[i]);
  }
  serializeJson(Analyticsdoc, json);
}

void Pill_Status_to_JSON() // generates JSON from refill struct
{
  json = "";
  //            'pillNames': fill.pillNames,
  //            'pillQuantities': fill.pillQuantities

  DynamicJsonDocument Refilldoc(1024);

  JsonArray pillNameArr = Refilldoc.createNestedArray("pillNames");
  JsonArray pillQuantitiesArr = Refilldoc.createNestedArray("pillQuantities");

  for (int i = 0; i < pillContainersCount; i++)
    pillNameArr.add(fill.pillNames[i]);

  for (int i = 0; i < pillContainersCount; i++)
    pillQuantitiesArr.add(fill.pillQuantities[i]);

  serializeJson(Refilldoc, json);
  if(debug) Serial.println("json is " + json);
}

void Reminders_to_JSON()
{
  json = "";
  //            'hour':schedule[i].hour
  //            'minute':schedule[i].minute
  //            'pillQuantities': schedule[i].pillQuantities

  // JsonObject remixnders = Reminderdoc.createNestedObject("reminders");
  DynamicJsonDocument Reminderdoc(2048);

  JsonArray RemindersArr = Reminderdoc.createNestedArray("reminders");

  JsonObject obj[8];

  for(int i=0; i<pillContainersCount; i++)
  {
    obj[i] = RemindersArr.createNestedObject();
    obj[i]["hour"] = schedule[i].hour;
    obj[i]["minute"] = schedule[i].minute;
    JsonArray pillQuantitiesArr = obj[i].createNestedArray("pillQuantities");
    for (int j = 0; j < pillContainersCount; j++) pillQuantitiesArr.add(schedule[i].pillQuantities[j]);

  }

  serializeJson(RemindersArr, json);

  if(debug) Serial.println("json is " + json);
}

void loop() // main code to run repeatedly: 
{

  //  WiFiClient client = server.available();

  if (WiFiCredentialsReady() && WiFiNotSet)
  {
    if (debug)
      Serial.print("\nWiFi ssid and password are set and not set up\n");

    WiFi_setup();

    if (debug)
      Serial.print("\nWiFi ssid and password are set and is set up\n");

    WiFiNotSet = false;
  }

  if (!WiFiNotSet) MDNS.update();
  

  if (Serial.available()) // if UART RX port has data
  {
    handleUARTRX(); // call RX function to handle RX UART inputs
  }

  server.handleClient();

  delay(500);
}